{
	"cards": [
		{
			"id":"1",
			"subject": "Фронтенд",
			"teacher": "Лебедева Ф.С.",
			"coins": "10",
			"task": "Разработка сайта",
			"description": "Создать онлайн-магазин косметики с фильтрацией и поиском, личным кабинетом, предусмотреть защиту функционала для неавторизованных пользователей. Приложение также должно предоставлять информацию о стоимости товаров, картинки, описание и возможность оплатить и заказать товар. Для оплаты используйте sber pay. По всем вопросам можете обращаться ко мне. Важно: приложение должно быть адаптивным под устройствам от 600px до 2400px",
			"status": ""
		},
		{
			"id":"2",
			"subject": "Алгоритмы и структуры данных",
			"teacher": "Конкуров Ф.П.",
			"coins": "3",
			"task": "Сортировка слиянием",
			"description": "Напишите программу на любом языке программирования, реализующую алгоритм сортировки слиянием для массива целых чисел. Оцените время выполнения алгоритма для различных размеров входных данных и проведите сравнение с другими алгоритмами сортировки.",
			"status": ""
		},
		{
			"id":"3",
			"subject": "Базы данных",
			"teacher": "Смолова А.С.",
			"coins": "2",
			"task":"Оптимизация SQL-запросов",
			"description": "Дана база данных с несколькими таблицами. Напишите неэффективный SQL-запрос, затем оптимизируйте его для улучшения производительности. Объясните, какие индексы были использованы, и как изменения повлияли на время выполнения запроса.",
			"status": ""
		},
		{
			"id":"4",
			"subject": "Компьютерные сети",
			"teacher": "Рябов П.В.",
			"coins": "5",
			"task":"Настройка маршрутизатора и брандмауэра",
			"description": "Настройте маршрутизатор и брандмауэр для домашней сети. Установите правила фильтрации трафика, настройте перенаправление портов и настройте виртуальную частную сеть (VPN). Обеспечьте безопасность сети и документируйте вашу конфигурацию",
			"status": ""
		},
		{
			"id":"5",
			"subject": "Тестирование программного обеспечения",
			"teacher": "Шелист К.Е.",
			"coins": "5",
			"task":"Написание unit-тестов",
			"description": "Напишите набор юнит-тестов для одной из функций вашего проекта. Используйте фреймворк для тестирования, такой как JUnit, NUnit или PyTest. Оцените покрытие кода тестами и улучшите его, если необходимо.",
			"status": ""
		},
		{
			"id":"6",
			"subject": "Операционные системы",
			"teacher": "Рябов П.В.",
			"coins": "7",
			"task":"Многозадачность и потоки",
			"description": "Напишите программу, демонстрирующую многозадачность и использование потоков. Используйте механизмы синхронизации, такие как мьютексы или семафоры, чтобы избежать конфликтов между потоками. Оцените производительность при разном количестве одновременно выполняющихся задач.",
			"status": ""
		}
	]
}